{
    "libc.so": {
      "default": "The crash is happening in a DEFAULT Android library and cannot be obtained... Just try to update all mods or remove recently installed!"
    },
    "libGLESv2.so": {
      "default": "Your GPU driver just crashed?"
    },
    "libGLESv2_adreno.so": {
      "default": "Your GPU driver just crashed?"
    },
    "libAML.so": {
      "default": "The AML library has been crashed! Report it to the AML author!"
    },
    "libGTASA.so": {
      "0x1E73B6": "This crash is related to the RLEDecompress. If you have some texdb mods installed, install some other or try to fix the current.",
      "0x5B95FC": "Remove mod named VehicleShadowFix",
      "0x3EB9FC": "Too much mods?! Try to increase this limit in FLA: rwObjectInstances",
      "0x591EA4": "Broken IFP may result in this, because the crash is happening because it cant get correct animations for vehicle",
      "0x222DB6": "The game used deleted texture. This may be the mod`s fault",
      "0x44EB06": "Something with the matrices. The model is just too heavy. Try to increase this limit in FLA: Matrices",
      "0x26726A": "The game is trying to read files that doesnt exists. Check if your game cache missing something",
      "0x2670D4": "The game is trying to read files that doesnt exists. Check if your game cache missing something",
      "0x6AACCC": "This is the weird crash code, but the reason is that some mod is destroying a very important object",
      "0x213DF6": "Something is happening with the models. You can try to disable PreloadLODs in JPatch",
      "0x4CE6A2": "Something is wrong with 'tasks'. There is no solution, atleast i dont know any? Too much peds?!",
      "0x5946EC": "Try to increase this limit in FLA: Water triangles, Water quads, Water quads and triangles list, Water vertices",
      "0x40EAAC": "A game tried to work with deleted entity. Are you using Lighthouse & Pyramid Fix by Junior_Djjr?",
      "0x4D6A76": "Update NCOO, it`s too old",
      "0x280F28": "IPL file is corrupted!",
      "0x3519BC": "Crash in opcode 04FE - BURST_CAR_TYRE. The problem is a CLEO/Scripts. Are you modifying a lot of cars?",
      "0x35682A": "Crash in opcode 0611 - IS_CHAR_PLAYING_ANIM. The problem is a CLEO/Scripts. Are you using Improved main.scm?",
      "0x5AADEE": "Crash is happening while trying to read text from GXT, and so you have broken GXT",
      "0x1E47B6": "Got crashed in a second after starting the game? Well, there is no known solution for this, yet",

      "AuthorOfBelow_001": "ARM or ARAH",

      "0x5A3A5E": "Update JPatch or disable BuffDistForLightCoronas in it`s config",
      "0x1AD682": "Some textures are missing",
      "0x1B00A2": "Missing DETAIL texture in the cache",
      "0x1BD08A": "Some of the IDE files are broken because they have wrong id for LOD!",
      "0x1D8526": "DFF model is too heavy",
      "0x1E5762": "Failed to load DFF/IFP that is located outside of IMG archive (like grass DFFs, PED.IFP), probably because they dont exists",
      "0x1E59E0": "Failed to load DFF/IFP that is located outside of IMG archive (like grass DFFs, PED.IFP), probably because they dont exists",
      "0x1E7F9A": "A problem loading texdb file",
      "0x1E908A": "Texdb cache is missing?",
      "0x1EA24A": "Texdb cache is missing?",
      "0x1EA236": "Texdb cache is missing?",
      "0x25F0A4": "ARM says it`s missing cutscene model, but the game code says it`s something related to the sound",
      "0x26711E": "The game is trying to read files that doesnt exists. Check if your game cache missing something",
      "0x267658": "The game is trying to read files that doesnt exists. Check if your game cache missing something",
      "0x27EB24": "Heavy audio file or broken OSW. Make sure your OSW is not ZIP with higher compression",
      "0x280F3A": "The game tried to get LOD model for a regular model but it does not exists",
      "0x2CA02A": "Missing texture vehiclegrunge256",
      "0x2D29A8": "Streaming can not load the model info because previously it was failed to download it! Probably, the required object ID is not present in IDE files",
      "0x2D2AAE": "The game is trying to determine animation data from the model but it doesnt exists. Probably, the required object ID is not present in IDE files",
      "0x2DB49C": "This crash is happening because you set a very high value for the limits in FLA",
      "0x2DD29C": "This crash is happening because you set a very high value for the limits in FLA",
      "0x2E172E": "Reached the limit of used collision models. Try to increase this limit in FLA: ColModels",
      "0x2E2198": "Reached the limit of COL files. Merge COL files together in an editor or try to increase this limit in FLA: FILE_TYPE_COL",
      "0x2E30F8": "Somehow, reached the limit of Collision definitions. AML LimitAdjuster is fixing this",
      "0x301088": "For some reason the ped conversation ID is being set to 0. Maybe the problem is in PEDS.IDE",
      "0x32ACE4": "You reached the limit of running scripts. Try to increase this limit in FLA: Running Scripts",
      "0x32ACB4": "You reached the limit of running scripts. Try to increase this limit in FLA: Running Scripts",
      "0x32DA22": "You reached the limit of running scripts. Try to increase this limit in FLA: Running Scripts",
      "0x36711A": "The game tried to render some effect but failed to! Probably your effects.fxp file is corrupted",
      "0x36E390": "One of the effects in effects.fxp doesnt have NUM_INFOS or PRIM",
      "0x384AC0": "Missing vehicle mod, probably you need to fix your veh_mods.ide",
      "0x384DD6": "It seems like the vehicle model is broken. Have you installed some custom vehicle models?",
      "0x38509A": "The model is missing the required collision model. Are you using Beta Mulholland mod?",
      "0x385A04": "You reached the limit of objects. Try to increase this limit in FLA: IDE Objects Type 1",
      "0x385FD0": "You reached the limit of timed objects. Try to increase this limit in FLA: Timed Objects",
      "0x386038": "You reached the limit of weapon models. Try to increase this limit in FLA: Weapon Models",
      "0x386070": "You reached the limit of clump models. Try to increase this limit in FLA: Hier Object",
      "0x3879EA": "You reached the limit of clump models. Try to increase this limit in FLA: Hier Object",
      "0x3860A8": "You reached the limit of vehicle models. Try to increase this limit in FLA: Vehicle Models",
      "0x3860DE": "You reached the limit of ped models. Try to increase this limit in FLA: Ped Models",
      "0x38611A": "The boat`s model info is missing. Probably, the line for this boat in handling.cfg is missing",
      "0x386156": "The model info is missing. Probably the game created an object with wrong ID",
      "0x388574": "A wrong model for the boat in vehicles.ide or missing/broken wheel attachment for car",
      "0x389888": "A game tried to copy the animation. Probably your peds.ifp is broken?",
      "0x38A61C": "A game tried to uncompress the animation. Probably your peds.ifp is broken or weapon using unsupported animation?",
      "0x38B870": "A game tried to get the animation info. Probably your peds.ifp is broken or weapon using unsupported animation?",
      "0x38DD0E": "A game tried to uncompress the animation. Probably your peds.ifp is broken or weapon using unsupported animation?",
      "0x38E32C": "A game tried to apply the animation. Probably you have different animations for weapon in weapon.dat and default.ide?",
      "0x395FC2": "A game tried to play audio event but it`s missing!",
      "0x3EB07C": "A model doesnt have it`s model info. Probably the model is not present or was stuck in the save file",
      "0x3EBCF8": "A game tried to get the model boundaries but it has no collision or the model id is very big. Try to increase this limit in FLA: FILE_TYPE_DFF",
      "0x3EBF56": "A game tried to get the model boundaries but it has no collision or the model id is very big. Maybe IPL is broken.",
      "0x3EDA9A": "You reached the limit of PtrNode Doubles. Try to increase this limit in FLA: PtrNode Doubles",
      "0x3FCF52": "You reached the limit of PtrNode Doubles. Try to increase this limit in FLA: PtrNode Doubles",
      "0x3EDB34": "You reached the limit of PtrNode Single or LOD sector size is very low. Try to increase this limit in FLA: PtrNode Single",
      "0x3FCF6C": "You reached the limit of EntryInfoNodes. Try to increase this limit in FLA: EntryInfoNodes",
      "0x3EDFB0": "The broken model or the save file is corrupted. Try to load a save file and if the crash still exists, find out the problematic model",
      "0x4086C6": "You reached the limit of Buildings or Dummies. Try to increase this limit in FLA: Buildings, Dummies. CLEO script can cause this",
      "0x408B7A": "You reached the limit of Matrices. Try to increase this limit in FLA: Matrices",
      "0x408C88": "You reached the limit of Matrices. Try to increase this limit in FLA: Matrices",
      "0x4232C2": "You reached the limit of killable models id. Try to increase this limit in FLA: Killable Models",
      "0x4232C4": "A game tries to delete an object but it`s not yet loaded",
      "0x44305C": "A missing or broken radar texture is loaded",
      "0x443172": "A missing or broken radar texture is loaded",
      "0x44313E": "A missing or broken radar texture is loaded",
      "0x4564C0": "Undefined model in procobj.dat or it has no collision"
    }
  }